DataProcessors/ФормаИнформацииОРаботниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ФормаИнформацииОРаботниках</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборРазвернут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьКнопки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаВремениДляСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремениДляСредней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Назначение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетаИзмерение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВзносыВФондыРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВзносыВФондыРаботниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛьготыРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛьготыРаботниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьготРаботниковОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ФормаИнформацииОРаботниках/Ext/ObjectModule.bsl
Процедура ПечатьРегл (СтрокаРаботник, ТабДокумент) Экспорт
	
	Если СтрокаРаботник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СтрокаРаботник.Сотрудник;
	ФизЛицо = Сотрудник.ФизЛицо;
	Организация = СтрокаРаботник.Организация;
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.КодПоДРФО,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеРегл,
	|	РаботникиОрганизацийСрезПоследних.Должность КАК ДолжностьРегл,
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботыРегл,
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокРегл,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомерРегл,
	|   ВЫБОР
	|    КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА РаботникиОрганизацийСрезПоследних.Период
	|    ИНАЧЕ
	|     NULL
	|   КОНЕЦ КАК ДатаУвольненияРегл,
	|   ВЫБОР
	|    КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА ""Уволен""
	|    КОГДА СостояниеРаботниковОрганизацийСрезПоследних.Состояние ЕСТЬ NULL
	|     ТОГДА ""Работает""
	|    ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|   КОНЕЦ КАК СостояниеРегл
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.ФизЛицо
	|
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидНачисления,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта4,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель5,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта5,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель6,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта6,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.СпособОтраженияВБухучете
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатНачисления = Запрос.Выполнить();
	ВыборкаНачисления = РезультатНачисления.Выбрать();

   	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Организация,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель4,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта4,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель5,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта5,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель6,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта6,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.СпособОтраженияВБухучете
	|ИЗ
	|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник
	|		    И Организация = &Организация) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатУдержания = Запрос.Выполнить();
	ВыборкаУдержания = РезультатУдержания.Выбрать();

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Период,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Организация,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Налог,
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Актуальность
	|ИЗ
	|	РегистрСведений.ВзносыВФондыРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник И Организация = &Организация) КАК ВзносыВФондыРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ВзносыВФондыРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатВзносы = Запрос.Выполнить();
	ВыборкаВзносы = РезультатВзносы.Выбрать();

	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("Сотрудник" ,	Сотрудник);
	Запрос.УстановитьПараметр("Организация" ,	Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Период,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Организация,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Льгота,
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Актуальность
	|ИЗ
	|	РегистрСведений.ЛьготыРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник И Организация = &Организация) КАК ЛьготыРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ЛьготыРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатЛьготы = Запрос.Выполнить();
	ВыборкаЛьготы = РезультатЛьготы.Выбрать();

	
	ТабДокумент.Очистить();
	Макет = ПолучитьМакет("ДанныеПоФизлицу");

	Если Выборка.Следующий() Тогда
		//Общее
		Область= Макет.ПолучитьОбласть("Общее");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		//Место работы
		Область= Макет.ПолучитьОбласть("МестоРаботы");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("МестоРаботыКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;	
		//Состояние
		Область= Макет.ПолучитьОбласть("СостояниеРегл");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("СостояниеРеглКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;		
	Иначе
		Возврат;
	КонецЕсли;
	
	мСведенияОВидахРасчета = Новый Соответствие;
	//Начисления
	Область= Макет.ПолучитьОбласть("НачисленияРеглШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаНачисления.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаНачисления.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("НачисленияРеглСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаНачисления.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаНачисления);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("НачисленияРеглКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Удержания
	Область= Макет.ПолучитьОбласть("УдержанияРеглШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаУдержания.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаУдержания.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("УдержанияРеглСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаУдержания.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаУдержания);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("УдержанияРеглКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		

	//Взносы
	Область= Макет.ПолучитьОбласть("ВзносыШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаВзносы.Следующий() Цикл
		Область= Макет.ПолучитьОбласть("ВзносыСтрока");
		Область.Параметры.Заполнить(ВыборкаВзносы);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("ВзносыКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Льготы
	Область= Макет.ПолучитьОбласть("ЛьготыШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаЛьготы.Следующий() Цикл
		Область= Макет.ПолучитьОбласть("ЛьготыСтрока");
		Область.Параметры.Заполнить(ВыборкаЛьготы);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("ЛьготыКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		

	
	Возврат;

	
КонецПроцедуры	

Процедура ПечатьУпр (СтрокаРаботник, ТабДокумент)Экспорт
	
	Если СтрокаРаботник = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ФизЛицо = СтрокаРаботник.ФизЛицо;
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.ДатаРождения,
	|	ФизическиеЛица.КодПоДРФО,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	РаботникиСрезПоследних.Подразделение КАК ПодразделениеУпр,
	|	РаботникиСрезПоследних.Должность КАК ДолжностьУпр,
	|	РаботникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботыУпр,
	|	РаботникиСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокУпр,
	|   ВЫБОР
	|    КОГДА РаботникиСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА РаботникиСрезПоследних.Период
	|    ИНАЧЕ
	|     NULL
	|   КОНЕЦ КАК ДатаУвольненияУпр,
	|   ВЫБОР
	|    КОГДА РаботникиСрезПоследних.ЗанимаемыхСтавок = 0
	|     ТОГДА ""Уволен""
	|    КОГДА СостояниеРаботниковСрезПоследних.Состояние ЕСТЬ NULL
	|     ТОГДА ""Работает""
	|    ИНАЧЕ СостояниеРаботниковСрезПоследних.Состояние
	|   КОНЕЦ КАК СостояниеУпр
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК РаботникиСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = РаботникиСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК СостояниеРаботниковСрезПоследних
	|		ПО ФизическиеЛица.Ссылка = СостояниеРаботниковСрезПоследних.ФизЛицо
	|
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &ФизЛицо";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидНачисления,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.СпособОтраженияВУпрУчете
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник.ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатНачисления = Запрос.Выполнить();
	ВыборкаНачисления = РезультатНачисления.Выбрать();

   Запрос = Новый Запрос;

	// Установим параметры запроса.
	Запрос.УстановитьПараметр("ФизЛицо" ,	ФизЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности" ,	ДатаАктуальности);
	Запрос.УстановитьПараметр("Истина" ,Истина);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта1,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта2,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Валюта3,
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.СпособОтраженияВУпрУчете
	|ИЗ
	|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник.ФизЛицо = &ФизЛицо) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
	|ГДЕ 
	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Актуальность = &Истина";

	РезультатУдержания = Запрос.Выполнить();
	ВыборкаУдержания = РезультатУдержания.Выбрать();

	
	ТабДокумент.Очистить();
	Макет = ПолучитьМакет("ДанныеПоФизлицу");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.КодЯзыкаИнформационнойБазы();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	Если Выборка.Следующий() Тогда
		//Общее
		Область= Макет.ПолучитьОбласть("Общее");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		//Место работы
		Область= Макет.ПолучитьОбласть("МестоРаботыУпр");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("МестоРаботыупрКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;	
		//Состояние
		Область= Макет.ПолучитьОбласть("СостояниеУпр");
		Область.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Область);
		Если ПоказыватьКнопки Тогда
			Область= Макет.ПолучитьОбласть("СостояниеУпрКнопки");
			ТабДокумент.Вывести(Область);
		КонецЕсли;		
	Иначе
		Возврат;
	КонецЕсли;
	
	мСведенияОВидахРасчета = Новый Соответствие;
	
	//Начисления
	Область= Макет.ПолучитьОбласть("НачисленияУпрШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаНачисления.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаНачисления.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("НачисленияУпрСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаНачисления.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаНачисления);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("НачисленияУпрКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;		
	
	//Удержания
	Область= Макет.ПолучитьОбласть("УдержанияУпрШапка");
	ТабДокумент.Вывести(Область);
	Пока ВыборкаУдержания.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(ВыборкаУдержания.ВидРасчета) Тогда
			Продолжить;
		КонецЕсли;	
		Область= Макет.ПолучитьОбласть("УдержанияУпрСтрока");
		СведенияОВидеРасчета = ПроведениеРасчетов.ПолучитьСведенияОВидеРасчетаСхемыМотивации(мСведенияОВидахРасчета, ВыборкаУдержания.ВидРасчета);
		Область.Параметры.Заполнить(СведенияОВидеРасчета);
		Область.Параметры.Заполнить(ВыборкаУдержания);
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	Если ПоказыватьКнопки Тогда
		Область= Макет.ПолучитьОбласть("УдержанияУпрКнопки");
		ТабДокумент.Вывести(Область);
	КонецЕсли;

	
КонецПроцедуры
